In [1]:
import pandas as pd
from sklearn import preprocessing
import numpy as np

In [24]:
life_exp = pd.read_csv('life_expectancy_years.csv')

In [3]:
pop = pd.read_csv('population_total.csv')

In [4]:
gnp = pd.read_csv('ny_gnp_pcap_pp_cd.csv')

In [25]:
life_exp = life_exp.ffill(axis=0)

In [6]:
pop = pop.ffill(axis=0)

In [7]:
gnp = gnp.ffill(axis=1)

In [8]:
sum(gnp.isna().sum())

0

In [15]:
pop_new = pd.melt(pop,["country"],var_name = "year",value_name="population")
pop_new.head()

                country  year population
0           Afghanistan  1800      3.28M
1                Angola  1800      1.57M
2               Albania  1800       400k
3               Andorra  1800       2650
4  United Arab Emirates  1800      40.2k

In [27]:
life_new = pd.melt(life_exp,["country"],var_name = "year",value_name="life_expectancy")
life_new.head()

                country  year  life_expectancy
0           Afghanistan  1800             28.2
1                Angola  1800             27.0
2               Albania  1800             35.4
3               Andorra  1800             35.4
4  United Arab Emirates  1800             30.7

In [17]:
gnp_new = pd.melt(pop,["country"],var_name = "year",value_name="GNI per cap")
gnp_new.head()

                country  year GNI per cap
0           Afghanistan  1800       3.28M
1                Angola  1800       1.57M
2               Albania  1800        400k
3               Andorra  1800        2650
4  United Arab Emirates  1800       40.2k

In [18]:
gnp_new.shape

(59297, 3)

In [28]:
life_new.shape

(58695, 3)

In [29]:
pop_new.shape

(59297, 3)

In [38]:
final_csv = pop_new.merge(life_new,how='left',on=['country','year'])
final_csv = final_csv.merge(gnp_new,how='left',on=['country','year'])
final_csv.head()

                country  year population  life_expectancy GNI per cap
0           Afghanistan  1800      3.28M             28.2       3.28M
1                Angola  1800      1.57M             27.0       1.57M
2               Albania  1800       400k             35.4        400k
3               Andorra  1800       2650             35.4        2650
4  United Arab Emirates  1800      40.2k             30.7       40.2k

In [39]:
final_csv.to_csv("gapminder.csv")